In [103]:
import pandas as pd

#### Criando DataFrames

In [104]:
df1 = pd.DataFrame()

In [105]:
df1

Empty DataFrame
Columns: []
Index: []

In [106]:
type(df1)

pandas.core.frame.DataFrame

In [107]:
# Olhá só como foi importante aprender sobre dicionários 

dict1= {'identificação': [1,2,3,4,5],
       'nome': ['Sandra', 'Sebastião','Samuel', 'Ismeria', 'Hinata']}

In [108]:
dict1

{'identificação': [1, 2, 3, 4, 5],
 'nome': ['Sandra', 'Sebastião', 'Samuel', 'Ismeria', 'Hinata']}

In [109]:
df2 = pd.DataFrame(data = dict1, index = [1,2,3,4,5])

In [110]:
df2

   identificação       nome
1              1     Sandra
2              2  Sebastião
3              3     Samuel
4              4    Ismeria
5              5     Hinata

In [111]:
serie1 = pd.Series([1,2,3])

In [112]:
serie1

0    1
1    2
2    3
dtype: int64

In [113]:
type(serie1)

pandas.core.series.Series

In [114]:
serie2 = pd.Series(['a','b','c'])

In [115]:
df4 = pd.DataFrame({'coluna1': serie1,
                   'coluna2': serie2})

In [116]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

In [117]:
import numpy as np

In [118]:
array1 = np.array([[1,2,3,],
                  ['São Paulo', 'Rio de Janeiro', 'Minas Gerias'],
                  ['SP', 'RJ', 'MG']])

In [119]:
array1

array([['1', '2', '3'],
       ['São Paulo', 'Rio de Janeiro', 'Minas Gerias'],
       ['SP', 'RJ', 'MG']], dtype='<U14')

In [120]:
type(array1)

numpy.ndarray

In [121]:
df5 = pd.DataFrame(data= array1.transpose(),
                  index = ['linha1', 'linha2', 'linha3'],
                  columns = ['Identificação', 'Cidade', 'Estado'])

In [122]:
df5

       Identificação          Cidade Estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3    Minas Gerias     MG

In [123]:
matriz1 = np.matrix([[1,2,3,],
                  ['São Paulo', 'Rio de Janeiro', 'Minas Gerias'],
                  ['SP', 'RJ', 'MG']])

In [124]:
type(matriz1)

numpy.matrix

In [125]:
matriz1

matrix([['1', '2', '3'],
        ['São Paulo', 'Rio de Janeiro', 'Minas Gerias'],
        ['SP', 'RJ', 'MG']], dtype='<U14')

In [126]:
df6 = pd.DataFrame(data= matriz1.transpose(),
                  index = ['linha1', 'linha2', 'linha3'],
                  columns = ['Identificação', 'Cidade', 'Estado'])

In [127]:
df6

       Identificação          Cidade Estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3    Minas Gerias     MG

### Selecionando DataFrames

In [128]:
df2

   identificação       nome
1              1     Sandra
2              2  Sebastião
3              3     Samuel
4              4    Ismeria
5              5     Hinata

In [129]:
df2['identificação_mais_5'] = df2['identificação'] + 5

In [130]:
df2

   identificação       nome  identificação_mais_5
1              1     Sandra                     6
2              2  Sebastião                     7
3              3     Samuel                     8
4              4    Ismeria                     9
5              5     Hinata                    10

In [131]:
df2['index'] = 0

In [132]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Sebastião                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [133]:
df2['nome']

1       Sandra
2    Sebastião
3       Samuel
4      Ismeria
5       Hinata
Name: nome, dtype: object

In [134]:
df2.nome

1       Sandra
2    Sebastião
3       Samuel
4      Ismeria
5       Hinata
Name: nome, dtype: object

In [135]:
df2.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [136]:
df2[['nome', 'index']]

        nome  index
1     Sandra      0
2  Sebastião      0
3     Samuel      0
4    Ismeria      0
5     Hinata      0

In [137]:
df2[df2.identificação % 2 == 0 ]

   identificação       nome  identificação_mais_5  index
2              2  Sebastião                     7      0
4              4    Ismeria                     9      0

In [138]:
df2[df2.nome.str.contains('r')]

   identificação     nome  identificação_mais_5  index
1              1   Sandra                     6      0
4              4  Ismeria                     9      0

In [139]:
df2[df2.nome.str.contains('r') & df2.identificação ==1]

   identificação    nome  identificação_mais_5  index
1              1  Sandra                     6      0

In [140]:
df2[df2.nome.str.contains('r') | df2.identificação == 4]

Empty DataFrame
Columns: [identificação, nome, identificação_mais_5, index]
Index: []

- loc: localizar pelo NOME dos índices ou colunas
- iloc: localizar pela POSIÇÃO dos índices ou colunas

In [141]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Sebastião                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [142]:
df2.loc[1]

identificação                1
nome                    Sandra
identificação_mais_5         6
index                        0
Name: 1, dtype: object

In [143]:
df2.iloc[1]

identificação                   2
nome                    Sebastião
identificação_mais_5            7
index                           0
Name: 2, dtype: object

In [144]:
df2.loc[1:5]

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Sebastião                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [145]:
df2.iloc[1:5]

   identificação       nome  identificação_mais_5  index
2              2  Sebastião                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [146]:
df2.loc[5:1:-1]

   identificação       nome  identificação_mais_5  index
5              5     Hinata                    10      0
4              4    Ismeria                     9      0
3              3     Samuel                     8      0
2              2  Sebastião                     7      0
1              1     Sandra                     6      0

In [147]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Sebastião                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [148]:
df2.loc[:,'nome']

1       Sandra
2    Sebastião
3       Samuel
4      Ismeria
5       Hinata
Name: nome, dtype: object

In [149]:
df2.iloc[:,1]

1       Sandra
2    Sebastião
3       Samuel
4      Ismeria
5       Hinata
Name: nome, dtype: object

In [150]:
df2.loc[2,'nome']

'Sebastião'

In [151]:
df2.iloc[3,1]

'Ismeria'

In [152]:
df2.loc[2,'nome'] = 'Tiãozinho'

In [153]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Tiãozinho                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [154]:
df2.iloc[-1]

identificação                5
nome                    Hinata
identificação_mais_5        10
index                        0
Name: 5, dtype: object

In [155]:
df2.iloc[-1,-2]

10

In [156]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Tiãozinho                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [157]:
df2.loc[[1,2]]

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Tiãozinho                     7      0

In [158]:
df2.iloc[[1,2]]

   identificação       nome  identificação_mais_5  index
2              2  Tiãozinho                     7      0
3              3     Samuel                     8      0

### Atributos de DataFrame

In [159]:
df2

   identificação       nome  identificação_mais_5  index
1              1     Sandra                     6      0
2              2  Tiãozinho                     7      0
3              3     Samuel                     8      0
4              4    Ismeria                     9      0
5              5     Hinata                    10      0

In [160]:
df2.dtypes

identificação            int64
nome                    object
identificação_mais_5     int64
index                    int64
dtype: object

In [161]:
df2.identificação = df2.identificação.astype(str)

In [162]:
df2.dtypes

identificação           object
nome                    object
identificação_mais_5     int64
index                    int64
dtype: object

In [163]:
df2['Teste'] = [None, 2, 4, None, 10]

In [164]:
df2

  identificação       nome  identificação_mais_5  index  Teste
1             1     Sandra                     6      0    NaN
2             2  Tiãozinho                     7      0    2.0
3             3     Samuel                     8      0    4.0
4             4    Ismeria                     9      0    NaN
5             5     Hinata                    10      0   10.0

In [165]:
df2.dtypes

identificação            object
nome                     object
identificação_mais_5      int64
index                     int64
Teste                   float64
dtype: object

In [166]:
df2.columns

Index(['identificação', 'nome', 'identificação_mais_5', 'index', 'Teste'], dtype='object')

In [167]:
df2.columns = ['identificação', 'nome', 'identificação_mais_5', 'index_MODIFICADO', 'Teste']

In [168]:
df2

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [169]:
df2.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [170]:
df2.shape

(5, 5)

In [171]:
df2.values

array([['1', 'Sandra', 6, 0, nan],
       ['2', 'Tiãozinho', 7, 0, 2.0],
       ['3', 'Samuel', 8, 0, 4.0],
       ['4', 'Ismeria', 9, 0, nan],
       ['5', 'Hinata', 10, 0, 10.0]], dtype=object)

### Métodos I

#### combine_first

In [172]:
df2

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [173]:
df2.Teste.combine_first(df2['identificação_mais_5'])

1     6.0
2     2.0
3     4.0
4     9.0
5    10.0
Name: Teste, dtype: float64

#### copy

In [174]:
df100 = df2.copy()

In [175]:
df100

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [176]:
#### count

In [177]:
df100.count()

identificação           5
nome                    5
identificação_mais_5    5
index_MODIFICADO        5
Teste                   3
dtype: int64

#### drop

In [178]:
df2

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [179]:
df2.drop(columns =['index_MODIFICADO'])

  identificação       nome  identificação_mais_5  Teste
1             1     Sandra                     6    NaN
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

In [180]:
df2

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [183]:
df2 = df2.drop(columns =['index_MODIFICADO'])

KeyError: "['index_MODIFICADO'] not found in axis"

In [182]:
df2.drop(columns = ['index_MODIFICADO'], inplace=True)

KeyError: "['index_MODIFICADO'] not found in axis"

In [185]:
df2.drop(index = [1], inplace=True)

In [186]:
df2

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

#### drop_duplicates

In [189]:
df7 = pd.concat([df100, df100])

In [190]:
df7

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [191]:
df7.drop_duplicates(inplace=True)

In [192]:
df7

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

#### dropna

In [193]:
df8 = df7.copy()

In [194]:
df8

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [196]:
df8.dropna(inplace=True)

In [197]:
df8

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
5             5     Hinata                    10                 0   10.0

#### fillna

In [198]:
df7

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [199]:
df7.fillna('Nulo', inplace=True)

In [200]:
df7

  identificação       nome  identificação_mais_5  index_MODIFICADO Teste
1             1     Sandra                     6                 0  Nulo
2             2  Tiãozinho                     7                 0   2.0
3             3     Samuel                     8                 0   4.0
4             4    Ismeria                     9                 0  Nulo
5             5     Hinata                    10                 0  10.0

#### head

In [202]:
df7.head(2)

  identificação       nome  identificação_mais_5  index_MODIFICADO Teste
1             1     Sandra                     6                 0  Nulo
2             2  Tiãozinho                     7                 0   2.0

#### tail

In [203]:
df7.tail(2)

  identificação     nome  identificação_mais_5  index_MODIFICADO Teste
4             4  Ismeria                     9                 0  Nulo
5             5   Hinata                    10                 0  10.0

#### groupby

In [204]:
df10 = pd.concat([df100, df100])

In [205]:
df10

  identificação       nome  identificação_mais_5  index_MODIFICADO  Teste
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0
1             1     Sandra                     6                 0    NaN
2             2  Tiãozinho                     7                 0    2.0
3             3     Samuel                     8                 0    4.0
4             4    Ismeria                     9                 0    NaN
5             5     Hinata                    10                 0   10.0

In [206]:
df10.groupby(['nome']).identificação_mais_5.sum()

nome
Hinata       20
Ismeria      18
Samuel       16
Sandra       12
Tiãozinho    14
Name: identificação_mais_5, dtype: int64

### Módulos II

In [207]:
df2

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

#### isin

In [208]:
df2.isin([2,4])

   identificação   nome  identificação_mais_5  Teste
2          False  False                 False   True
3          False  False                 False   True
4          False  False                 False  False
5          False  False                 False  False

In [210]:
df2.isin(['2','4'])

   identificação   nome  identificação_mais_5  Teste
2           True  False                 False  False
3          False  False                 False  False
4           True  False                 False  False
5          False  False                 False  False

In [212]:
df2[df2.isin(['2','4']) == True]

  identificação nome  identificação_mais_5  Teste
2             2  NaN                   NaN    NaN
3           NaN  NaN                   NaN    NaN
4             4  NaN                   NaN    NaN
5           NaN  NaN                   NaN    NaN

In [213]:
df2[df2.identificação.isin(['2','4']) == True]

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
4             4    Ismeria                     9    NaN

In [214]:
df2[df2.Teste.isin([2, 4]) == True]

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0

#### operações

In [215]:
df2

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

In [216]:
df2.identificação_mais_5.min()

7

In [217]:
df2.identificação_mais_5.max()

10

In [218]:
df2.identificação_mais_5.mean()

8.5

In [219]:
df2.identificação_mais_5.median()

8.5

In [220]:
df2.identificação_mais_5.sum()

34

In [221]:
df2.identificação_mais_5.std()

1.2909944487358056

#### notnull

In [222]:
df2

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

In [223]:
df2.Teste.notnull()

2     True
3     True
4    False
5     True
Name: Teste, dtype: bool

In [224]:
df2[df2.Teste.notnull() == True]

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
5             5     Hinata                    10   10.0

#### rename

In [225]:
df2

  identificação       nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

In [227]:
df2.rename(columns={'nome': 'Nome'}, inplace=True)

In [228]:
df2

  identificação       Nome  identificação_mais_5  Teste
2             2  Tiãozinho                     7    2.0
3             3     Samuel                     8    4.0
4             4    Ismeria                     9    NaN
5             5     Hinata                    10   10.0

In [229]:
df2.rename(index={5:60}, inplace=True)

In [230]:
df2

   identificação       Nome  identificação_mais_5  Teste
2              2  Tiãozinho                     7    2.0
3              3     Samuel                     8    4.0
4              4    Ismeria                     9    NaN
60             5     Hinata                    10   10.0

#### replace

In [231]:
df2

   identificação       Nome  identificação_mais_5  Teste
2              2  Tiãozinho                     7    2.0
3              3     Samuel                     8    4.0
4              4    Ismeria                     9    NaN
60             5     Hinata                    10   10.0

In [233]:
df2.Nome.replace('Tiãozinho', 'Sebastião', inplace=True)

In [234]:
df2

   identificação       Nome  identificação_mais_5  Teste
2              2  Sebastião                     7    2.0
3              3     Samuel                     8    4.0
4              4    Ismeria                     9    NaN
60             5     Hinata                    10   10.0

#### round

In [235]:
df2['teste2'] = [1.25, 3.75, 4.95, 5.25]

In [236]:
df2

   identificação       Nome  identificação_mais_5  Teste  teste2
2              2  Sebastião                     7    2.0    1.25
3              3     Samuel                     8    4.0    3.75
4              4    Ismeria                     9    NaN    4.95
60             5     Hinata                    10   10.0    5.25

In [237]:
df2.teste2.round(0)

2     1.0
3     4.0
4     5.0
60    5.0
Name: teste2, dtype: float64

In [238]:
df2.teste2.round(1)

2     1.2
3     3.8
4     5.0
60    5.2
Name: teste2, dtype: float64

In [239]:
df2.teste2 = df2.teste2.round(1)

In [240]:
df2

   identificação       Nome  identificação_mais_5  Teste  teste2
2              2  Sebastião                     7    2.0     1.2
3              3     Samuel                     8    4.0     3.8
4              4    Ismeria                     9    NaN     5.0
60             5     Hinata                    10   10.0     5.2

#### to_clipboard()

In [241]:
df2.to_clipboard()

In [242]:
df2.to_clipboard(index=False)